#### Terraform Format and Style 🖌
#### Environment staging (CD)
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
confluent_environment.env: Refreshing state... [id=env-m2m7z2]
confluent_service_account.platform-manager: Refreshing state... [id=sa-7grvnj]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # confluent_api_key.platform-manager-kafka-api-key will be created
  + resource "confluent_api_key" "platform-manager-kafka-api-key" {
      + description            = "Kafka API Key that is owned by 'platform-manager' service account"
      + disable_wait_for_ready = false
      + display_name           = "platform-manager-kafka-api-key"
      + id                     = (known after apply)
      + secret                 = (sensitive value)

      + managed_resource {
          + api_version = (known after apply)
          + id          = (known after apply)
          + kind        = (known after apply)

          + environment {
              + id = "env-m2m7z2"
            }
        }

      + owner {
          + api_version = "iam/v2"
          + id          = "sa-7grvnj"
          + kind        = "ServiceAccount"
        }
    }

  # confluent_kafka_cluster.standard will be created
  + resource "confluent_kafka_cluster" "standard" {
      + api_version        = (known after apply)
      + availability       = "SINGLE_ZONE"
      + bootstrap_endpoint = (known after apply)
      + cloud              = "AWS"
      + display_name       = "standard_kafka_cluster"
      + id                 = (known after apply)
      + kind               = (known after apply)
      + rbac_crn           = (known after apply)
      + region             = "us-east-2"
      + rest_endpoint      = (known after apply)

      + environment {
          + id = "env-m2m7z2"
        }

      + standard {}
    }

  # confluent_role_binding.platform-manager-kafka-cluster-admin will be created
  + resource "confluent_role_binding" "platform-manager-kafka-cluster-admin" {
      + crn_pattern = (known after apply)
      + id          = (known after apply)
      + principal   = "User:sa-7grvnj"
      + role_name   = "CloudClusterAdmin"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

```

</details>
*Pushed by: @trung-cao-30, Action: `pull_request`*